package com.melo.weather.weatherlive.Utils;

/**
 * Created by lixiukui on 16/4/3.
 */
public class Constants {
        public static final String CLOSE = "Close";
        public static final String REALTIMEE = "Realtime";
        public static final String LIFE = "Life";
        public static final String WEATHER = "Weather";
        public static final String PM25 = "PM25";
//        public static final String SHOP = "Shop";
//        public static final String PARTY = "Party";
//        public static final String MOVIE = "Movie";
        public static final String[] SELECT = {"Close","Realtime","Life","Weather","PM25"};
    public static String WeatherContent = "{\"reason\":\"成功\",\"result\":{\"data\":{\"realtime\":" +
            "{\"wind\":{\"windspeed\":\"0.0\",\"direct\":\"南风\",\"power\":\"2级\",\"offset\":null}," +
            "\"time\":\"20:00:00\",\"weather\":{\"humidity\":\"23\",\"img\":\"0\",\"info\":\"晴\",\"temperature\":\"15\"}," +
            "\"dataUptime\":1459687500,\"date\":\"2016-04-03\",\"city_code\":\"101010700\",\"city_name\":\"昌平\",\"week\":0," +
            "\"moon\":\"二月廿六\"},\"life\":{\"date\":\"2016-4-3\",\"info\":{\"kongtiao\":" +
            "[\"较少开启\",\"您将感到很舒适，一般不需要开启空调。\"],\"yundong\":[\"较适宜\",\"天气较好，户外运动请注意防晒。推荐您进行室内运动。\"]," +
            "\"ziwaixian\":[\"中等\",\"属中等强度紫外线辐射天气，外出时建议涂擦SPF高于15、PA+的防晒护肤品，戴帽子、太阳镜。\"],\"ganmao\"" +
            ":[\"易发\",\"昼夜温差很大，易发生感冒，请注意适当增减衣服，加强自我防护避免感冒。\"],\"xiche\":" +
            "[\"较适宜\",\"较适宜洗车，未来一天无雨，风力较小，擦洗一新的汽车至少能保持一天。\"],\"wuran\":" +
            "[\"较差\",\"气象条件较不利于空气污染物稀释、扩散和清除，请适当减少室外活动时间。\"],\"chuanyi\":" +
            "[\"较舒适\",\"建议着薄外套、开衫牛仔衫裤等服装。年老体弱者应适当添加衣物，宜着夹克衫、薄毛衣等。\"]}}," +
            "\"weather\":[{\"date\":\"2016-04-03\",\"info\":{\"night\":[\"0\",\"晴\",\"6\",\"无持续风向\",\"微风\",\"18:41\"]," +
            "\"day\":[\"0\",\"晴\",\"19\",\"无持续风向\",\"微风\",\"05:55\"]},\"week\":\"日\",\"nongli\":\"二月廿六\"}," +
            "{\"date\":\"2016-04-04\",\"info\":{\"dawn\":[\"0\",\"晴\",\"6\",\"无持续风向\",\"微风\",\"18:41\"]," +
            "\"night\":[\"0\",\"晴\",\"8\",\"无持续风向\",\"微风\",\"18:42\"],\"day\":[\"0\",\"晴\",\"22\"," +
            "\"无持续风向\",\"微风\",\"05:53\"]},\"week\":\"一\",\"nongli\":\"二月廿七\"},{\"date\":\"2016-04-05\"," +
            "\"info\":{\"dawn\":[\"0\",\"晴\",\"8\",\"无持续风向\",\"微风\",\"18:42\"],\"night\":[\"33\",\"霾\",\"11\"," +
            "\"无持续风向\",\"微风\",\"18:43\"],\"day\":[\"1\",\"多云\",\"24\",\"无持续风向\",\"微风\",\"05:52\"]},\"week\":\"二\"," +
            "\"nongli\":\"二月廿八\"},{\"date\":\"2016-04-06\",\"info\":{\"dawn\":[\"33\",\"霾\",\"11\",\"无持续风向\",\"微风\"," +
            "\"18:43\"],\"night\":[\"1\",\"多云\",\"10\",\"无持续风向\",\"微风\",\"18:44\"],\"day\":[\"33\",\"霾\",\"22\"," +
            "\"无持续风向\",\"微风\",\"05:50\"]},\"week\":\"三\",\"nongli\":\"二月廿九\"},{\"date\":\"2016-04-07\",\"info\"" +
            ":{\"dawn\":[\"1\",\"多云\",\"10\",\"无持续风向\",\"微风\",\"18:44\"],\"night\":[\"0\",\"晴\",\"7\",\"无持续风向\"," +
            "\"微风\",\"18:45\"],\"day\":[\"0\",\"晴\",\"22\",\"北风\",\"3-4 级\",\"05:48\"]},\"week\":\"四\",\"nongli\"" +
            ":\"三月初一\"},{\"date\":\"2016-04-08\",\"info\":{\"night\":[\"0\",\"晴\",\"10\",\"\",\"微风\",\"19:30\"]," +
            "\"day\":[\"0\",\"晴\",\"27\",\"\",\"微风\",\"07:30\"]},\"week\":\"五\",\"nongli\":\"三月初二\"}," +
            "{\"date\":\"2016-04-09\",\"info\":{\"night\":[\"0\",\"晴\",\"10\",\"西南风\",\"微风\",\"19:30\"]," +
            "\"day\":[\"0\",\"晴\",\"28\",\"西南风\",\"微风\",\"07:30\"]},\"week\":\"六\",\"nongli\":\"三月初三\"}]," +
            "\"pm25\":{\"key\":\"\",\"show_desc\":0,\"pm25\":{\"curPm\":\"93\",\"pm25\":\"32\",\"pm10\":\"93\"," +
            "\"level\":2,\"quality\":\"良\",\"des\":\"今天的空气质量是可以接受的，除少数异常敏感体质的人群外，大家可在户外正常活动。\"}," +
            "\"dateTime\":\"2016年04月03日20时\",\"cityName\":\"昌平\"},\"date\":null,\"isForeign\":0}},\"error_code\":0}";
}
